app/controllers/admin_controller.rb

SELECT * FROM "courses" WHERE ("courses"."course_number" = '1170') LIMIT 1
---
  def view_repo

    if params[:course_number]
      if Course.find_by_course_number(params[:course_number])