app/controllers/admin_controller.rb

SELECT * FROM "courses"
---
  def view_repo
    @courses = Course.all