app/controllers/categories_controller.rb

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("category", "created_at", "updated_at", "course_id") VALUES('"Hello, world!", chars, strings, and numbers', '2009-07-30 21:35:35', '2009-07-30 21:35:35', 1)

  def new
    @course_number = Course.find_by_course_number(params[:course_number])
---
SELECT * FROM "courses" WHERE ("courses"."course_number" = '1170') LIMIT 1