app/controllers/manage_controller.rb

  def modify

    if params[:course_number]
      if Course.find_by_course_number(params[:course_number])
---
SELECT * FROM "courses" WHERE ("courses"."course_number" = '1170') LIMIT 1