app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password", "lname", "user_level", "fname") VALUES('kstainke', '191099600.102070217583932', '2009-08-11 14:15:22', '2009-08-11 14:15:22', '89ae124bf010b2e2b804d3b092d341bed44c0a64', 'Stainke', 'true', 'Karl')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
      flash[:notice] = "User #{@user.name} deleted"
      @user.destroy